app/controllers/pics_controller.rb

  def create
    @picture = Picture.find(params[:picture_id])
---
SELECT  "pictures".* FROM "pictures" WHERE "pictures"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]