app/controllers/pictures_controller.rb

  def create
    @picture = Picture.new(picture_params)
    @picture.administrator_id = current_user.id

    respond_to do |format|
      if @picture.save
---
INSERT INTO "pictures" ("name", "description", "price", "condition", "created_at", "updated_at", "administrator_id") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

  def destroy
    @picture.destroy
---
DELETE FROM "pictures" WHERE "pictures"."id" = $1  [["id", 1]]

    def set_picture
      @picture = Picture.find(params[:id])
---
SELECT  "pictures".* FROM "pictures" WHERE "pictures"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]